{"skills":[{"name":"JavaScript","level":8,"justification":"Alex has used JavaScript (ES6+) extensively in both professional and academic contexts for front-end web and cross-platform app development. This includes over 14 months of daily production use at Northwind Digital Labs, leading the front-end of the Campus Event Explorer team project, and contributing to personal projects such as a responsive course planner and multiple web utilities. JavaScript is described as the 'core language' across roles and projects, implying frequent, complex, and independent use in real-world scenarios.","lastUsed":0.0,"usedWith":["Component library development in React at Northwind Digital Labs (June 2023–Present)","Campus Event Explorer team project (React, Node.js, MongoDB)","Responsive course planner project (vanilla JS, CSS Grid)","Resume site and various JS algorithm snippets"]},{"name":"React","level":8,"justification":"React is cited as a core technology in Alex's main professional position (Northwind Digital Labs, 14 months including promotion), with responsibilities ranging from building reusable component libraries and authoring documentation to leading accessibility initiatives and implementing cross-platform UI. React is also the front-end backbone of the 'Campus Event Explorer' capstone project. Given the depth of tasks such as library creation, accessibility advancement, and platform-specific logic, Alex demonstrates advanced skills, though the career is still early-stage.","lastUsed":0.0,"usedWith":["Reusable component libraries and design system work at Northwind Digital Labs (June 2023–Present)","Cross-platform UI logic (React web, React Native mobile)","Campus Event Explorer (capstone project, front-end lead)"]},{"name":"React Native","level":7,"justification":"React Native has been used directly for at least 14 months in production settings at Northwind Digital Labs and for full personal app builds (FitTrack Mobile), including reusable component design and mobile UI/UX work. Alex emphasizes cross-platform UI logic and has shipped and maintained mobile UI, demonstrating more than a learning-phase understanding. Level is estimated as advanced-intermediate given total professional exposure.","lastUsed":0.0,"usedWith":["Cross-platform UI implementation at Northwind Digital Labs (June 2023–Present)","FitTrack Mobile (personal React Native app)"]},{"name":"TypeScript","level":6,"justification":"TypeScript is described as a 'growing proficiency' used in both personal and professional projects. It is implied in the professional context with React/Redux, with stronger use in personal Angular projects. Description as 'intermediate' aligns with regular use but acknowledges ongoing development. The level reflects frequent, non-expert application and learning curve typical for developers early in their TypeScript journey.","lastUsed":0.0,"usedWith":["React-based library work and state management at Northwind Digital Labs","Personal Angular projects (e.g., TaskFlow Pro)"]},{"name":"Angular","level":5,"justification":"Alex is actively learning and applying modern Angular (versions 16–17) through substantial personal projects (TaskFlow Pro, various Udemy courses, following industry training). There is no production usage in a professional organization yet, but the candidate demonstrates robust understanding via self-driven work and continuous learning. Earlier exposure to AngularJS is present, but for Angular 2+ the level is intermediate-basic and closely aligned with current study and side projects rather than professional outputs.","lastUsed":0.0,"usedWith":["TaskFlow Pro (personal Angular 17 Kanban app)","Angular coursework and training (Udemy, official docs)"]},{"name":"Redux Toolkit","level":7,"justification":"Redux Toolkit is used in the core of Alex's current front-end work for API state management and complex UI state flows, including optimistic updates and error handling, at Northwind Digital Labs. Daily professional experience, design of robust state management flows, and documentation efforts indicate solid senior-junior level skills. The resume also references Redux Toolkit alongside React Query as central to state management solutions.","lastUsed":0.0,"usedWith":["Professional state management at Northwind Digital Labs (June 2023–Present)"]},{"name":"React Query","level":6,"justification":"React Query is implemented professionally at Northwind Digital Labs to manage API data fetching, caching, and error handling within React and React Native apps. While not discussed as deeply as Redux Toolkit, React Query is still part of daily workflow for complex UIs. Level is set at intermediate based on frequency of professional use.","lastUsed":0.0,"usedWith":["State and API/data fetching management at Northwind Digital Labs"]},{"name":"NgRx","level":4,"justification":"NgRx is mentioned as part of state management experience, most notably used in the personal TaskFlow Pro Angular project. There is no indication of professional use in production. Its presence in learning/projects, including setting up global state and streams, suggests basic–intermediate working knowledge acquired in self-driven settings.","lastUsed":0.0,"usedWith":["TaskFlow Pro (personal Angular 17 app)"]},{"name":"RxJS","level":5,"justification":"RxJS is cited in connection with both Angular coursework and the TaskFlow Pro project, used for setting up streams and reactive flows. While not professionally deployed yet, repeated practice and engagement with RxJS concepts in personal work and formal courses indicate an intermediate level useful for junior Angular developers. Current focus in self-study keeps lastUsed at 0.","lastUsed":0.0,"usedWith":["TaskFlow Pro (Angular personal project)","Angular courses and tutorials"]},{"name":"CSS","level":8,"justification":"Alex lists advanced experience with CSS3, SASS/SCSS, Styled Components, CSS Modules, and Tailwind, applied in professional component library development, cross-platform UI, and personal projects with responsive design (e.g., photo gallery, resume site). Direct responsibility for accessibility and theme/styling at Northwind Digital Labs, as well as skill in design tokens and responsive layouts, substantiates an advanced level. Regular production use and broad framework familiarity support a high level rating.","lastUsed":0.0,"usedWith":["Component library styling at Northwind Digital Labs (June 2023–Present)","Responsive personal projects (photo gallery, resume site)"]},{"name":"HTML","level":8,"justification":"HTML5 is a foundational skill for Alex, with recurring professional and project-based use. The resume highlights spearheading accessibility improvements (semantic HTML, ARIA), boosting Lighthouse scores, and ongoing web UI work. These tasks, combined with documentation on best practices and detailed semantic markup, indicate very strong HTML skills, used daily in current and prior projects.","lastUsed":0.0,"usedWith":["Accessibility improvements in design system at Northwind Digital Labs","All web-based project front-ends (professional and personal)"]},{"name":"Unit Testing","level":7,"justification":"Alex 'consistently wrote and maintained unit/integration tests' with Jest and React Testing Library for all production React/React Native code at Northwind Digital Labs. A high test coverage (85–95%) is maintained, involving both synchronous and asynchronous UI state. The routine and high-standard use of tests as part of key deliverables reflects thorough testing skills for a junior/intermediate developer in a modern FE stack.","lastUsed":0.0,"usedWith":["React and React Native feature/component development at Northwind Digital Labs"]},{"name":"Jest","level":7,"justification":"Jest is mentioned as a primary testing tool for unit/integration tests at Northwind Digital Labs and is used to maintain high test coverage in both React and React Native projects. The frequent application (high coverage, debugging async states) and solid understanding are evidence of advanced usage for a developer at this career stage. Jest is preferred in current production workflows.","lastUsed":0.0,"usedWith":["Testing for React/React Native at Northwind Digital Labs"]},{"name":"React Testing Library","level":7,"justification":"Worked with React Testing Library alongside Jest to produce and maintain a high standard of unit/integration testing in professional settings, specifically for React and React Native. The ability to sustain 85–95% test coverage for complex UI states strongly suggests a high intermediate to advanced competency, especially for an entry-level professional.","lastUsed":0.0,"usedWith":["Testing React/React Native features at Northwind Digital Labs"]},{"name":"Cypress","level":5,"justification":"Cypress is mentioned as a testing skill at an intermediate level based on routine professional and personal testing. While not specifically tied to a detailed context in the resume, its inclusion with high-frequency test tooling in a modern FE stack, plus practice in side projects, implies competent, practical knowledge. LastUsed is 0 as all testing practices are ongoing.","lastUsed":0.0,"usedWith":["Professional and personal front-end test suites"]},{"name":"Git","level":7,"justification":"Daily use of Git and GitHub as part of Agile workflow at Northwind Digital Labs (e.g., code reviews, feature branches, team collaboration). Also essential in all significant academic and project work (e.g., capstones, personal builds). The strong mention of documentation, PRs, and code review cycles further affirms an advanced, collaborative usage typical of a modern FE developer.","lastUsed":0.0,"usedWith":["Source control and collaboration at Northwind Digital Labs (June 2023–Present)","Team projects and personal repositories"]},{"name":"REST APIs","level":6,"justification":"REST APIs are integrated and designed in all major roles/projects, including API state management in React/Redux Toolkit/React Query and client-side consumption in campus and personal AngularJS projects. Responsibilities include integration for UI state, error handling, and optimistic flows. While not architecting backend endpoints, Alex regularly handles FE-side consumption and error modeling. Active use keeps lastUsed at 0.","lastUsed":0.0,"usedWith":["State management and API logic at Northwind Digital Labs","Campus Event Explorer, Student Budget Planner"]},{"name":"Node.js","level":4,"justification":"Node.js is referenced as used for tooling and some basic API work, most notably in the Campus Event Explorer project. There is no evidence of deep or regular backend development, making this a basic-to-intermediate utility/tooling skill as would be typical for FE devs setting up environments or quick APIs.","lastUsed":0.0,"usedWith":["Tooling and backend for Campus Event Explorer"]},{"name":"Express","level":3,"justification":"Express is briefly mentioned in the skills context as 'intro' only; it appears as a supporting backend skill for the Campus Event Explorer. Usage seems limited to learning, basic project scaffolding, or small features rather than production responsibilities. Accordingly, level is set low and lastUsed is 0, as side projects are active.","lastUsed":0.0,"usedWith":["Campus Event Explorer back-end (node.js, express, mongo)"]},{"name":"MongoDB","level":3,"justification":"MongoDB is reported in use for the Campus Event Explorer capstone alongside basic/introductory application in skills lists. This appears to be bounded to student project scope and beginner API integrations rather than any robust deployment or advanced modeling. Level reflects foundational exposure at an academic or side-project level, not yet expanded through professional roles.","lastUsed":0.0,"usedWith":["Campus Event Explorer (capstone, back-end database)"]},{"name":"AngularJS","level":4,"justification":"Alex has contributed to maintenance and refactoring of a legacy AngularJS (1.x) tool at Northwind Digital Labs, fixing bugs and performing minor upgrades. Additionally, early exposure was gained through a campus project (Student Budget Planner). There is no mention of major new feature development or modern SPA work with AngularJS, hence the moderately basic-intermediate level. Last used is 0 months, as ongoing support is mentioned alongside main FE role.","lastUsed":0.0,"usedWith":["Legacy internal tool maintenance at Northwind Digital Labs","Student Budget Planner campus project"]},{"name":"Agile","level":5,"justification":"Frequent and structured participation in Agile ceremonies (standups, planning, retrospectives, ticket creation) is described as part of Alex’s professional workflow at Northwind Digital Labs. Agile practices are also cited as part of relevant university coursework. This sustained involvement suggests solid intermediate familiarity with Agile, as expected for an entry-level developer contributing actively in daily standups and project sprints.","lastUsed":0.0,"usedWith":["Daily workflows at Northwind Digital Labs","Software Engineering coursework"]},{"name":"Mentoring","level":4,"justification":"Alex mentored interns, onboarded new team members, and was recognized for initiative in documentation and communications at Northwind Digital Labs. While the mentoring experience is recent and not at a managerial level, it is clearly cited and relates to team support for new/junior devs. Estimated as intermediate for a new professional, recently active.","lastUsed":0.0,"usedWith":["Intern onboarding and documentation at Northwind Digital Labs (2023–Present)"]},{"name":"Documentation","level":7,"justification":"The resume highlights substantial contributions to documentation, including authoring detailed component usage, accessibility notes in Storybook, project build notes, and robust documentation habits across both professional and personal projects. Recognition upon promotion was partly attributed to documentation skills. The breadth and clarity described suggest an advanced standard for documentation and developer communication.","lastUsed":0.0,"usedWith":["Storybook docs and internal guides at Northwind Digital Labs","Project build notes (TaskFlow Pro, various personal projects)"]},{"name":"Communication","level":6,"justification":"Alex receives explicit praise for clear written and verbal communication in code reviews, documentation, and Agile participation. These skills are acknowledged during performance review and promotion discussions. Communication is especially emphasized for technical contexts (PRs, standups) and onboarding/mentoring scenarios. Estimated as strong for an entry-level professional based on repeated role-based feedback.","lastUsed":0.0,"usedWith":["Team collaboration at Northwind Digital Labs","Mentoring, code reviews, and Agile ceremonies"]}]}